7767517
353 387
Input            data             0 1 data 0=600 1=600 2=3
BatchNorm        bn_data          1 1 data bn_data 0=3
Scale            bn_data_scale    1 1 bn_data bn_data_bn_data_scale 0=3 1=1
Convolution      conv0            1 1 bn_data_bn_data_scale conv0 0=64 1=7 11=7 2=1 3=2 4=3 14=3 5=0 6=9408 8=2
BatchNorm        bn0              1 1 conv0 bn0 0=64
Scale            bn0_scale        1 1 bn0 bn0_bn0_scale 0=64 1=1
ReLU             relu0            1 1 bn0_bn0_scale bn0_relu0
Pooling          pooling0         1 1 bn0_relu0 pooling0 0=0 1=3 2=2 3=1 13=1 4=0
BatchNorm        stage1_unit1_bn1 1 1 pooling0 stage1_unit1_bn1 0=64
Scale            stage1_unit1_bn1_scale 1 1 stage1_unit1_bn1 stage1_unit1_bn1_stage1_unit1_bn1_scale 0=64 1=1
ReLU             stage1_unit1_relu1 1 1 stage1_unit1_bn1_stage1_unit1_bn1_scale stage1_unit1_bn1_stage1_unit1_relu1
Split            splitncnn_0      1 2 stage1_unit1_bn1_stage1_unit1_relu1 stage1_unit1_bn1_stage1_unit1_relu1_splitncnn_0 stage1_unit1_bn1_stage1_unit1_relu1_splitncnn_1
Convolution      stage1_unit1_conv1 1 1 stage1_unit1_bn1_stage1_unit1_relu1_splitncnn_1 stage1_unit1_conv1 0=64 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=4096 8=2
Convolution      stage1_unit1_sc  1 1 stage1_unit1_bn1_stage1_unit1_relu1_splitncnn_0 stage1_unit1_sc 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=16384 8=2
BatchNorm        stage1_unit1_bn2 1 1 stage1_unit1_conv1 stage1_unit1_bn2 0=64
Scale            stage1_unit1_bn2_scale 1 1 stage1_unit1_bn2 stage1_unit1_bn2_stage1_unit1_bn2_scale 0=64 1=1
ReLU             stage1_unit1_relu2 1 1 stage1_unit1_bn2_stage1_unit1_bn2_scale stage1_unit1_bn2_stage1_unit1_relu2
Convolution      stage1_unit1_conv2 1 1 stage1_unit1_bn2_stage1_unit1_relu2 stage1_unit1_conv2 0=64 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=36864 8=2
BatchNorm        stage1_unit1_bn3 1 1 stage1_unit1_conv2 stage1_unit1_bn3 0=64
Scale            stage1_unit1_bn3_scale 1 1 stage1_unit1_bn3 stage1_unit1_bn3_stage1_unit1_bn3_scale 0=64 1=1
ReLU             stage1_unit1_relu3 1 1 stage1_unit1_bn3_stage1_unit1_bn3_scale stage1_unit1_bn3_stage1_unit1_relu3
Convolution      stage1_unit1_conv3 1 1 stage1_unit1_bn3_stage1_unit1_relu3 stage1_unit1_conv3 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=16384 8=2
Eltwise          plus0            2 1 stage1_unit1_conv3 stage1_unit1_sc plus0 0=1 -23301=0
Split            splitncnn_1      1 2 plus0 plus0_splitncnn_0 plus0_splitncnn_1
BatchNorm        stage1_unit2_bn1 1 1 plus0_splitncnn_1 stage1_unit2_bn1 0=256
Scale            stage1_unit2_bn1_scale 1 1 stage1_unit2_bn1 stage1_unit2_bn1_stage1_unit2_bn1_scale 0=256 1=1
ReLU             stage1_unit2_relu1 1 1 stage1_unit2_bn1_stage1_unit2_bn1_scale stage1_unit2_bn1_stage1_unit2_relu1
Convolution      stage1_unit2_conv1 1 1 stage1_unit2_bn1_stage1_unit2_relu1 stage1_unit2_conv1 0=64 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=16384 8=2
BatchNorm        stage1_unit2_bn2 1 1 stage1_unit2_conv1 stage1_unit2_bn2 0=64
Scale            stage1_unit2_bn2_scale 1 1 stage1_unit2_bn2 stage1_unit2_bn2_stage1_unit2_bn2_scale 0=64 1=1
ReLU             stage1_unit2_relu2 1 1 stage1_unit2_bn2_stage1_unit2_bn2_scale stage1_unit2_bn2_stage1_unit2_relu2
Convolution      stage1_unit2_conv2 1 1 stage1_unit2_bn2_stage1_unit2_relu2 stage1_unit2_conv2 0=64 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=36864 8=2
BatchNorm        stage1_unit2_bn3 1 1 stage1_unit2_conv2 stage1_unit2_bn3 0=64
Scale            stage1_unit2_bn3_scale 1 1 stage1_unit2_bn3 stage1_unit2_bn3_stage1_unit2_bn3_scale 0=64 1=1
ReLU             stage1_unit2_relu3 1 1 stage1_unit2_bn3_stage1_unit2_bn3_scale stage1_unit2_bn3_stage1_unit2_relu3
Convolution      stage1_unit2_conv3 1 1 stage1_unit2_bn3_stage1_unit2_relu3 stage1_unit2_conv3 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=16384 8=2
Eltwise          plus1            2 1 stage1_unit2_conv3 plus0_splitncnn_0 plus1 0=1 -23301=0
Split            splitncnn_2      1 2 plus1 plus1_splitncnn_0 plus1_splitncnn_1
BatchNorm        stage1_unit3_bn1 1 1 plus1_splitncnn_1 stage1_unit3_bn1 0=256
Scale            stage1_unit3_bn1_scale 1 1 stage1_unit3_bn1 stage1_unit3_bn1_stage1_unit3_bn1_scale 0=256 1=1
ReLU             stage1_unit3_relu1 1 1 stage1_unit3_bn1_stage1_unit3_bn1_scale stage1_unit3_bn1_stage1_unit3_relu1
Convolution      stage1_unit3_conv1 1 1 stage1_unit3_bn1_stage1_unit3_relu1 stage1_unit3_conv1 0=64 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=16384 8=2
BatchNorm        stage1_unit3_bn2 1 1 stage1_unit3_conv1 stage1_unit3_bn2 0=64
Scale            stage1_unit3_bn2_scale 1 1 stage1_unit3_bn2 stage1_unit3_bn2_stage1_unit3_bn2_scale 0=64 1=1
ReLU             stage1_unit3_relu2 1 1 stage1_unit3_bn2_stage1_unit3_bn2_scale stage1_unit3_bn2_stage1_unit3_relu2
Convolution      stage1_unit3_conv2 1 1 stage1_unit3_bn2_stage1_unit3_relu2 stage1_unit3_conv2 0=64 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=36864 8=2
BatchNorm        stage1_unit3_bn3 1 1 stage1_unit3_conv2 stage1_unit3_bn3 0=64
Scale            stage1_unit3_bn3_scale 1 1 stage1_unit3_bn3 stage1_unit3_bn3_stage1_unit3_bn3_scale 0=64 1=1
ReLU             stage1_unit3_relu3 1 1 stage1_unit3_bn3_stage1_unit3_bn3_scale stage1_unit3_bn3_stage1_unit3_relu3
Convolution      stage1_unit3_conv3 1 1 stage1_unit3_bn3_stage1_unit3_relu3 stage1_unit3_conv3 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=16384 8=2
Eltwise          plus2            2 1 stage1_unit3_conv3 plus1_splitncnn_0 plus2 0=1 -23301=0
BatchNorm        stage2_unit1_bn1 1 1 plus2 stage2_unit1_bn1 0=256
Scale            stage2_unit1_bn1_scale 1 1 stage2_unit1_bn1 stage2_unit1_bn1_stage2_unit1_bn1_scale 0=256 1=1
ReLU             stage2_unit1_relu1 1 1 stage2_unit1_bn1_stage2_unit1_bn1_scale stage2_unit1_bn1_stage2_unit1_relu1
Split            splitncnn_3      1 2 stage2_unit1_bn1_stage2_unit1_relu1 stage2_unit1_bn1_stage2_unit1_relu1_splitncnn_0 stage2_unit1_bn1_stage2_unit1_relu1_splitncnn_1
Convolution      stage2_unit1_conv1 1 1 stage2_unit1_bn1_stage2_unit1_relu1_splitncnn_1 stage2_unit1_conv1 0=128 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=32768 8=2
Convolution      stage2_unit1_sc  1 1 stage2_unit1_bn1_stage2_unit1_relu1_splitncnn_0 stage2_unit1_sc 0=512 1=1 11=1 2=1 3=2 4=0 14=0 5=0 6=131072 8=2
BatchNorm        stage2_unit1_bn2 1 1 stage2_unit1_conv1 stage2_unit1_bn2 0=128
Scale            stage2_unit1_bn2_scale 1 1 stage2_unit1_bn2 stage2_unit1_bn2_stage2_unit1_bn2_scale 0=128 1=1
ReLU             stage2_unit1_relu2 1 1 stage2_unit1_bn2_stage2_unit1_bn2_scale stage2_unit1_bn2_stage2_unit1_relu2
Convolution      stage2_unit1_conv2 1 1 stage2_unit1_bn2_stage2_unit1_relu2 stage2_unit1_conv2 0=128 1=3 11=3 2=1 3=2 4=1 14=1 5=0 6=147456 8=2
BatchNorm        stage2_unit1_bn3 1 1 stage2_unit1_conv2 stage2_unit1_bn3 0=128
Scale            stage2_unit1_bn3_scale 1 1 stage2_unit1_bn3 stage2_unit1_bn3_stage2_unit1_bn3_scale 0=128 1=1
ReLU             stage2_unit1_relu3 1 1 stage2_unit1_bn3_stage2_unit1_bn3_scale stage2_unit1_bn3_stage2_unit1_relu3
Convolution      stage2_unit1_conv3 1 1 stage2_unit1_bn3_stage2_unit1_relu3 stage2_unit1_conv3 0=512 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=65536 8=2
Eltwise          plus3            2 1 stage2_unit1_conv3 stage2_unit1_sc plus3 0=1 -23301=0
Split            splitncnn_4      1 2 plus3 plus3_splitncnn_0 plus3_splitncnn_1
BatchNorm        stage2_unit2_bn1 1 1 plus3_splitncnn_1 stage2_unit2_bn1 0=512
Scale            stage2_unit2_bn1_scale 1 1 stage2_unit2_bn1 stage2_unit2_bn1_stage2_unit2_bn1_scale 0=512 1=1
ReLU             stage2_unit2_relu1 1 1 stage2_unit2_bn1_stage2_unit2_bn1_scale stage2_unit2_bn1_stage2_unit2_relu1
Convolution      stage2_unit2_conv1 1 1 stage2_unit2_bn1_stage2_unit2_relu1 stage2_unit2_conv1 0=128 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=65536 8=2
BatchNorm        stage2_unit2_bn2 1 1 stage2_unit2_conv1 stage2_unit2_bn2 0=128
Scale            stage2_unit2_bn2_scale 1 1 stage2_unit2_bn2 stage2_unit2_bn2_stage2_unit2_bn2_scale 0=128 1=1
ReLU             stage2_unit2_relu2 1 1 stage2_unit2_bn2_stage2_unit2_bn2_scale stage2_unit2_bn2_stage2_unit2_relu2
Convolution      stage2_unit2_conv2 1 1 stage2_unit2_bn2_stage2_unit2_relu2 stage2_unit2_conv2 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=147456 8=2
BatchNorm        stage2_unit2_bn3 1 1 stage2_unit2_conv2 stage2_unit2_bn3 0=128
Scale            stage2_unit2_bn3_scale 1 1 stage2_unit2_bn3 stage2_unit2_bn3_stage2_unit2_bn3_scale 0=128 1=1
ReLU             stage2_unit2_relu3 1 1 stage2_unit2_bn3_stage2_unit2_bn3_scale stage2_unit2_bn3_stage2_unit2_relu3
Convolution      stage2_unit2_conv3 1 1 stage2_unit2_bn3_stage2_unit2_relu3 stage2_unit2_conv3 0=512 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=65536 8=2
Eltwise          plus4            2 1 stage2_unit2_conv3 plus3_splitncnn_0 plus4 0=1 -23301=0
Split            splitncnn_5      1 2 plus4 plus4_splitncnn_0 plus4_splitncnn_1
BatchNorm        stage2_unit3_bn1 1 1 plus4_splitncnn_1 stage2_unit3_bn1 0=512
Scale            stage2_unit3_bn1_scale 1 1 stage2_unit3_bn1 stage2_unit3_bn1_stage2_unit3_bn1_scale 0=512 1=1
ReLU             stage2_unit3_relu1 1 1 stage2_unit3_bn1_stage2_unit3_bn1_scale stage2_unit3_bn1_stage2_unit3_relu1
Convolution      stage2_unit3_conv1 1 1 stage2_unit3_bn1_stage2_unit3_relu1 stage2_unit3_conv1 0=128 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=65536 8=2
BatchNorm        stage2_unit3_bn2 1 1 stage2_unit3_conv1 stage2_unit3_bn2 0=128
Scale            stage2_unit3_bn2_scale 1 1 stage2_unit3_bn2 stage2_unit3_bn2_stage2_unit3_bn2_scale 0=128 1=1
ReLU             stage2_unit3_relu2 1 1 stage2_unit3_bn2_stage2_unit3_bn2_scale stage2_unit3_bn2_stage2_unit3_relu2
Convolution      stage2_unit3_conv2 1 1 stage2_unit3_bn2_stage2_unit3_relu2 stage2_unit3_conv2 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=147456 8=2
BatchNorm        stage2_unit3_bn3 1 1 stage2_unit3_conv2 stage2_unit3_bn3 0=128
Scale            stage2_unit3_bn3_scale 1 1 stage2_unit3_bn3 stage2_unit3_bn3_stage2_unit3_bn3_scale 0=128 1=1
ReLU             stage2_unit3_relu3 1 1 stage2_unit3_bn3_stage2_unit3_bn3_scale stage2_unit3_bn3_stage2_unit3_relu3
Convolution      stage2_unit3_conv3 1 1 stage2_unit3_bn3_stage2_unit3_relu3 stage2_unit3_conv3 0=512 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=65536 8=2
Eltwise          plus5            2 1 stage2_unit3_conv3 plus4_splitncnn_0 plus5 0=1 -23301=0
Split            splitncnn_6      1 2 plus5 plus5_splitncnn_0 plus5_splitncnn_1
BatchNorm        stage2_unit4_bn1 1 1 plus5_splitncnn_1 stage2_unit4_bn1 0=512
Scale            stage2_unit4_bn1_scale 1 1 stage2_unit4_bn1 stage2_unit4_bn1_stage2_unit4_bn1_scale 0=512 1=1
ReLU             stage2_unit4_relu1 1 1 stage2_unit4_bn1_stage2_unit4_bn1_scale stage2_unit4_bn1_stage2_unit4_relu1
Convolution      stage2_unit4_conv1 1 1 stage2_unit4_bn1_stage2_unit4_relu1 stage2_unit4_conv1 0=128 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=65536 8=2
BatchNorm        stage2_unit4_bn2 1 1 stage2_unit4_conv1 stage2_unit4_bn2 0=128
Scale            stage2_unit4_bn2_scale 1 1 stage2_unit4_bn2 stage2_unit4_bn2_stage2_unit4_bn2_scale 0=128 1=1
ReLU             stage2_unit4_relu2 1 1 stage2_unit4_bn2_stage2_unit4_bn2_scale stage2_unit4_bn2_stage2_unit4_relu2
Convolution      stage2_unit4_conv2 1 1 stage2_unit4_bn2_stage2_unit4_relu2 stage2_unit4_conv2 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=147456 8=2
BatchNorm        stage2_unit4_bn3 1 1 stage2_unit4_conv2 stage2_unit4_bn3 0=128
Scale            stage2_unit4_bn3_scale 1 1 stage2_unit4_bn3 stage2_unit4_bn3_stage2_unit4_bn3_scale 0=128 1=1
ReLU             stage2_unit4_relu3 1 1 stage2_unit4_bn3_stage2_unit4_bn3_scale stage2_unit4_bn3_stage2_unit4_relu3
Convolution      stage2_unit4_conv3 1 1 stage2_unit4_bn3_stage2_unit4_relu3 stage2_unit4_conv3 0=512 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=65536 8=2
Eltwise          plus6            2 1 stage2_unit4_conv3 plus5_splitncnn_0 plus6 0=1 -23301=0
BatchNorm        stage3_unit1_bn1 1 1 plus6 stage3_unit1_bn1 0=512
Scale            stage3_unit1_bn1_scale 1 1 stage3_unit1_bn1 stage3_unit1_bn1_stage3_unit1_bn1_scale 0=512 1=1
ReLU             stage3_unit1_relu1 1 1 stage3_unit1_bn1_stage3_unit1_bn1_scale stage3_unit1_bn1_stage3_unit1_relu1
Split            splitncnn_7      1 2 stage3_unit1_bn1_stage3_unit1_relu1 stage3_unit1_bn1_stage3_unit1_relu1_splitncnn_0 stage3_unit1_bn1_stage3_unit1_relu1_splitncnn_1
Convolution      stage3_unit1_conv1 1 1 stage3_unit1_bn1_stage3_unit1_relu1_splitncnn_1 stage3_unit1_conv1 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=131072 8=2
Convolution      stage3_unit1_sc  1 1 stage3_unit1_bn1_stage3_unit1_relu1_splitncnn_0 stage3_unit1_sc 0=1024 1=1 11=1 2=1 3=2 4=0 14=0 5=0 6=524288 8=2
BatchNorm        stage3_unit1_bn2 1 1 stage3_unit1_conv1 stage3_unit1_bn2 0=256
Scale            stage3_unit1_bn2_scale 1 1 stage3_unit1_bn2 stage3_unit1_bn2_stage3_unit1_bn2_scale 0=256 1=1
ReLU             stage3_unit1_relu2 1 1 stage3_unit1_bn2_stage3_unit1_bn2_scale stage3_unit1_bn2_stage3_unit1_relu2
Split            splitncnn_8      1 2 stage3_unit1_bn2_stage3_unit1_relu2 stage3_unit1_bn2_stage3_unit1_relu2_splitncnn_0 stage3_unit1_bn2_stage3_unit1_relu2_splitncnn_1
Convolution      stage3_unit1_conv2 1 1 stage3_unit1_bn2_stage3_unit1_relu2_splitncnn_1 stage3_unit1_conv2 0=256 1=3 11=3 2=1 3=2 4=1 14=1 5=0 6=589824 8=2
Convolution      ssh_m1_red_conv  1 1 stage3_unit1_bn2_stage3_unit1_relu2_splitncnn_0 ssh_m1_red_conv 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=65536 8=2
BatchNorm        stage3_unit1_bn3 1 1 stage3_unit1_conv2 stage3_unit1_bn3 0=256
Scale            stage3_unit1_bn3_scale 1 1 stage3_unit1_bn3 stage3_unit1_bn3_stage3_unit1_bn3_scale 0=256 1=1
BatchNorm        ssh_m1_red_conv_bn 1 1 ssh_m1_red_conv ssh_m1_red_conv_bn 0=256
Scale            ssh_m1_red_conv_bn_scale 1 1 ssh_m1_red_conv_bn ssh_m1_red_conv_bn_ssh_m1_red_conv_bn_scale 0=256 1=1
ReLU             stage3_unit1_relu3 1 1 stage3_unit1_bn3_stage3_unit1_bn3_scale stage3_unit1_bn3_stage3_unit1_relu3
ReLU             ssh_m1_red_conv_relu 1 1 ssh_m1_red_conv_bn_ssh_m1_red_conv_bn_scale ssh_m1_red_conv_bn_ssh_m1_red_conv_relu
Split            splitncnn_9      1 2 ssh_m1_red_conv_bn_ssh_m1_red_conv_relu ssh_m1_red_conv_bn_ssh_m1_red_conv_relu_splitncnn_0 ssh_m1_red_conv_bn_ssh_m1_red_conv_relu_splitncnn_1
Convolution      stage3_unit1_conv3 1 1 stage3_unit1_bn3_stage3_unit1_relu3 stage3_unit1_conv3 0=1024 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=262144 8=2
Eltwise          plus7            2 1 stage3_unit1_conv3 stage3_unit1_sc plus7 0=1 -23301=0
Split            splitncnn_10     1 2 plus7 plus7_splitncnn_0 plus7_splitncnn_1
BatchNorm        stage3_unit2_bn1 1 1 plus7_splitncnn_1 stage3_unit2_bn1 0=1024
Scale            stage3_unit2_bn1_scale 1 1 stage3_unit2_bn1 stage3_unit2_bn1_stage3_unit2_bn1_scale 0=1024 1=1
ReLU             stage3_unit2_relu1 1 1 stage3_unit2_bn1_stage3_unit2_bn1_scale stage3_unit2_bn1_stage3_unit2_relu1
Convolution      stage3_unit2_conv1 1 1 stage3_unit2_bn1_stage3_unit2_relu1 stage3_unit2_conv1 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=262144 8=2
BatchNorm        stage3_unit2_bn2 1 1 stage3_unit2_conv1 stage3_unit2_bn2 0=256
Scale            stage3_unit2_bn2_scale 1 1 stage3_unit2_bn2 stage3_unit2_bn2_stage3_unit2_bn2_scale 0=256 1=1
ReLU             stage3_unit2_relu2 1 1 stage3_unit2_bn2_stage3_unit2_bn2_scale stage3_unit2_bn2_stage3_unit2_relu2
Convolution      stage3_unit2_conv2 1 1 stage3_unit2_bn2_stage3_unit2_relu2 stage3_unit2_conv2 0=256 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=589824 8=2
BatchNorm        stage3_unit2_bn3 1 1 stage3_unit2_conv2 stage3_unit2_bn3 0=256
Scale            stage3_unit2_bn3_scale 1 1 stage3_unit2_bn3 stage3_unit2_bn3_stage3_unit2_bn3_scale 0=256 1=1
ReLU             stage3_unit2_relu3 1 1 stage3_unit2_bn3_stage3_unit2_bn3_scale stage3_unit2_bn3_stage3_unit2_relu3
Convolution      stage3_unit2_conv3 1 1 stage3_unit2_bn3_stage3_unit2_relu3 stage3_unit2_conv3 0=1024 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=262144 8=2
Eltwise          plus8            2 1 stage3_unit2_conv3 plus7_splitncnn_0 plus8 0=1 -23301=0
Split            splitncnn_11     1 2 plus8 plus8_splitncnn_0 plus8_splitncnn_1
BatchNorm        stage3_unit3_bn1 1 1 plus8_splitncnn_1 stage3_unit3_bn1 0=1024
Scale            stage3_unit3_bn1_scale 1 1 stage3_unit3_bn1 stage3_unit3_bn1_stage3_unit3_bn1_scale 0=1024 1=1
ReLU             stage3_unit3_relu1 1 1 stage3_unit3_bn1_stage3_unit3_bn1_scale stage3_unit3_bn1_stage3_unit3_relu1
Convolution      stage3_unit3_conv1 1 1 stage3_unit3_bn1_stage3_unit3_relu1 stage3_unit3_conv1 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=262144 8=2
BatchNorm        stage3_unit3_bn2 1 1 stage3_unit3_conv1 stage3_unit3_bn2 0=256
Scale            stage3_unit3_bn2_scale 1 1 stage3_unit3_bn2 stage3_unit3_bn2_stage3_unit3_bn2_scale 0=256 1=1
ReLU             stage3_unit3_relu2 1 1 stage3_unit3_bn2_stage3_unit3_bn2_scale stage3_unit3_bn2_stage3_unit3_relu2
Convolution      stage3_unit3_conv2 1 1 stage3_unit3_bn2_stage3_unit3_relu2 stage3_unit3_conv2 0=256 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=589824 8=2
BatchNorm        stage3_unit3_bn3 1 1 stage3_unit3_conv2 stage3_unit3_bn3 0=256
Scale            stage3_unit3_bn3_scale 1 1 stage3_unit3_bn3 stage3_unit3_bn3_stage3_unit3_bn3_scale 0=256 1=1
ReLU             stage3_unit3_relu3 1 1 stage3_unit3_bn3_stage3_unit3_bn3_scale stage3_unit3_bn3_stage3_unit3_relu3
Convolution      stage3_unit3_conv3 1 1 stage3_unit3_bn3_stage3_unit3_relu3 stage3_unit3_conv3 0=1024 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=262144 8=2
Eltwise          plus9            2 1 stage3_unit3_conv3 plus8_splitncnn_0 plus9 0=1 -23301=0
Split            splitncnn_12     1 2 plus9 plus9_splitncnn_0 plus9_splitncnn_1
BatchNorm        stage3_unit4_bn1 1 1 plus9_splitncnn_1 stage3_unit4_bn1 0=1024
Scale            stage3_unit4_bn1_scale 1 1 stage3_unit4_bn1 stage3_unit4_bn1_stage3_unit4_bn1_scale 0=1024 1=1
ReLU             stage3_unit4_relu1 1 1 stage3_unit4_bn1_stage3_unit4_bn1_scale stage3_unit4_bn1_stage3_unit4_relu1
Convolution      stage3_unit4_conv1 1 1 stage3_unit4_bn1_stage3_unit4_relu1 stage3_unit4_conv1 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=262144 8=2
BatchNorm        stage3_unit4_bn2 1 1 stage3_unit4_conv1 stage3_unit4_bn2 0=256
Scale            stage3_unit4_bn2_scale 1 1 stage3_unit4_bn2 stage3_unit4_bn2_stage3_unit4_bn2_scale 0=256 1=1
ReLU             stage3_unit4_relu2 1 1 stage3_unit4_bn2_stage3_unit4_bn2_scale stage3_unit4_bn2_stage3_unit4_relu2
Convolution      stage3_unit4_conv2 1 1 stage3_unit4_bn2_stage3_unit4_relu2 stage3_unit4_conv2 0=256 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=589824 8=2
BatchNorm        stage3_unit4_bn3 1 1 stage3_unit4_conv2 stage3_unit4_bn3 0=256
Scale            stage3_unit4_bn3_scale 1 1 stage3_unit4_bn3 stage3_unit4_bn3_stage3_unit4_bn3_scale 0=256 1=1
ReLU             stage3_unit4_relu3 1 1 stage3_unit4_bn3_stage3_unit4_bn3_scale stage3_unit4_bn3_stage3_unit4_relu3
Convolution      stage3_unit4_conv3 1 1 stage3_unit4_bn3_stage3_unit4_relu3 stage3_unit4_conv3 0=1024 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=262144 8=2
Eltwise          plus10           2 1 stage3_unit4_conv3 plus9_splitncnn_0 plus10 0=1 -23301=0
Split            splitncnn_13     1 2 plus10 plus10_splitncnn_0 plus10_splitncnn_1
BatchNorm        stage3_unit5_bn1 1 1 plus10_splitncnn_1 stage3_unit5_bn1 0=1024
Scale            stage3_unit5_bn1_scale 1 1 stage3_unit5_bn1 stage3_unit5_bn1_stage3_unit5_bn1_scale 0=1024 1=1
ReLU             stage3_unit5_relu1 1 1 stage3_unit5_bn1_stage3_unit5_bn1_scale stage3_unit5_bn1_stage3_unit5_relu1
Convolution      stage3_unit5_conv1 1 1 stage3_unit5_bn1_stage3_unit5_relu1 stage3_unit5_conv1 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=262144 8=2
BatchNorm        stage3_unit5_bn2 1 1 stage3_unit5_conv1 stage3_unit5_bn2 0=256
Scale            stage3_unit5_bn2_scale 1 1 stage3_unit5_bn2 stage3_unit5_bn2_stage3_unit5_bn2_scale 0=256 1=1
ReLU             stage3_unit5_relu2 1 1 stage3_unit5_bn2_stage3_unit5_bn2_scale stage3_unit5_bn2_stage3_unit5_relu2
Convolution      stage3_unit5_conv2 1 1 stage3_unit5_bn2_stage3_unit5_relu2 stage3_unit5_conv2 0=256 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=589824 8=2
BatchNorm        stage3_unit5_bn3 1 1 stage3_unit5_conv2 stage3_unit5_bn3 0=256
Scale            stage3_unit5_bn3_scale 1 1 stage3_unit5_bn3 stage3_unit5_bn3_stage3_unit5_bn3_scale 0=256 1=1
ReLU             stage3_unit5_relu3 1 1 stage3_unit5_bn3_stage3_unit5_bn3_scale stage3_unit5_bn3_stage3_unit5_relu3
Convolution      stage3_unit5_conv3 1 1 stage3_unit5_bn3_stage3_unit5_relu3 stage3_unit5_conv3 0=1024 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=262144 8=2
Eltwise          plus11           2 1 stage3_unit5_conv3 plus10_splitncnn_0 plus11 0=1 -23301=0
Split            splitncnn_14     1 2 plus11 plus11_splitncnn_0 plus11_splitncnn_1
BatchNorm        stage3_unit6_bn1 1 1 plus11_splitncnn_1 stage3_unit6_bn1 0=1024
Scale            stage3_unit6_bn1_scale 1 1 stage3_unit6_bn1 stage3_unit6_bn1_stage3_unit6_bn1_scale 0=1024 1=1
ReLU             stage3_unit6_relu1 1 1 stage3_unit6_bn1_stage3_unit6_bn1_scale stage3_unit6_bn1_stage3_unit6_relu1
Convolution      stage3_unit6_conv1 1 1 stage3_unit6_bn1_stage3_unit6_relu1 stage3_unit6_conv1 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=262144 8=2
BatchNorm        stage3_unit6_bn2 1 1 stage3_unit6_conv1 stage3_unit6_bn2 0=256
Scale            stage3_unit6_bn2_scale 1 1 stage3_unit6_bn2 stage3_unit6_bn2_stage3_unit6_bn2_scale 0=256 1=1
ReLU             stage3_unit6_relu2 1 1 stage3_unit6_bn2_stage3_unit6_bn2_scale stage3_unit6_bn2_stage3_unit6_relu2
Convolution      stage3_unit6_conv2 1 1 stage3_unit6_bn2_stage3_unit6_relu2 stage3_unit6_conv2 0=256 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=589824 8=2
BatchNorm        stage3_unit6_bn3 1 1 stage3_unit6_conv2 stage3_unit6_bn3 0=256
Scale            stage3_unit6_bn3_scale 1 1 stage3_unit6_bn3 stage3_unit6_bn3_stage3_unit6_bn3_scale 0=256 1=1
ReLU             stage3_unit6_relu3 1 1 stage3_unit6_bn3_stage3_unit6_bn3_scale stage3_unit6_bn3_stage3_unit6_relu3
Convolution      stage3_unit6_conv3 1 1 stage3_unit6_bn3_stage3_unit6_relu3 stage3_unit6_conv3 0=1024 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=262144 8=2
Eltwise          plus12           2 1 stage3_unit6_conv3 plus11_splitncnn_0 plus12 0=1 -23301=0
BatchNorm        stage4_unit1_bn1 1 1 plus12 stage4_unit1_bn1 0=1024
Scale            stage4_unit1_bn1_scale 1 1 stage4_unit1_bn1 stage4_unit1_bn1_stage4_unit1_bn1_scale 0=1024 1=1
ReLU             stage4_unit1_relu1 1 1 stage4_unit1_bn1_stage4_unit1_bn1_scale stage4_unit1_bn1_stage4_unit1_relu1
Split            splitncnn_15     1 2 stage4_unit1_bn1_stage4_unit1_relu1 stage4_unit1_bn1_stage4_unit1_relu1_splitncnn_0 stage4_unit1_bn1_stage4_unit1_relu1_splitncnn_1
Convolution      stage4_unit1_conv1 1 1 stage4_unit1_bn1_stage4_unit1_relu1_splitncnn_1 stage4_unit1_conv1 0=512 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=524288 8=2
Convolution      stage4_unit1_sc  1 1 stage4_unit1_bn1_stage4_unit1_relu1_splitncnn_0 stage4_unit1_sc 0=2048 1=1 11=1 2=1 3=2 4=0 14=0 5=0 6=2097152 8=2
BatchNorm        stage4_unit1_bn2 1 1 stage4_unit1_conv1 stage4_unit1_bn2 0=512
Scale            stage4_unit1_bn2_scale 1 1 stage4_unit1_bn2 stage4_unit1_bn2_stage4_unit1_bn2_scale 0=512 1=1
ReLU             stage4_unit1_relu2 1 1 stage4_unit1_bn2_stage4_unit1_bn2_scale stage4_unit1_bn2_stage4_unit1_relu2
Split            splitncnn_16     1 2 stage4_unit1_bn2_stage4_unit1_relu2 stage4_unit1_bn2_stage4_unit1_relu2_splitncnn_0 stage4_unit1_bn2_stage4_unit1_relu2_splitncnn_1
Convolution      stage4_unit1_conv2 1 1 stage4_unit1_bn2_stage4_unit1_relu2_splitncnn_1 stage4_unit1_conv2 0=512 1=3 11=3 2=1 3=2 4=1 14=1 5=0 6=2359296 8=2
Convolution      ssh_c2_lateral   1 1 stage4_unit1_bn2_stage4_unit1_relu2_splitncnn_0 ssh_c2_lateral 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=131072 8=2
BatchNorm        stage4_unit1_bn3 1 1 stage4_unit1_conv2 stage4_unit1_bn3 0=512
Scale            stage4_unit1_bn3_scale 1 1 stage4_unit1_bn3 stage4_unit1_bn3_stage4_unit1_bn3_scale 0=512 1=1
BatchNorm        ssh_c2_lateral_bn 1 1 ssh_c2_lateral ssh_c2_lateral_bn 0=256
Scale            ssh_c2_lateral_bn_scale 1 1 ssh_c2_lateral_bn ssh_c2_lateral_bn_ssh_c2_lateral_bn_scale 0=256 1=1
ReLU             stage4_unit1_relu3 1 1 stage4_unit1_bn3_stage4_unit1_bn3_scale stage4_unit1_bn3_stage4_unit1_relu3
ReLU             ssh_c2_lateral_relu 1 1 ssh_c2_lateral_bn_ssh_c2_lateral_bn_scale ssh_c2_lateral_bn_ssh_c2_lateral_relu
Split            splitncnn_17     1 2 ssh_c2_lateral_bn_ssh_c2_lateral_relu ssh_c2_lateral_bn_ssh_c2_lateral_relu_splitncnn_0 ssh_c2_lateral_bn_ssh_c2_lateral_relu_splitncnn_1
Convolution      stage4_unit1_conv3 1 1 stage4_unit1_bn3_stage4_unit1_relu3 stage4_unit1_conv3 0=2048 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=1048576 8=2
Eltwise          plus13           2 1 stage4_unit1_conv3 stage4_unit1_sc plus13 0=1 -23301=0
Split            splitncnn_18     1 2 plus13 plus13_splitncnn_0 plus13_splitncnn_1
BatchNorm        stage4_unit2_bn1 1 1 plus13_splitncnn_1 stage4_unit2_bn1 0=2048
Scale            stage4_unit2_bn1_scale 1 1 stage4_unit2_bn1 stage4_unit2_bn1_stage4_unit2_bn1_scale 0=2048 1=1
ReLU             stage4_unit2_relu1 1 1 stage4_unit2_bn1_stage4_unit2_bn1_scale stage4_unit2_bn1_stage4_unit2_relu1
Convolution      stage4_unit2_conv1 1 1 stage4_unit2_bn1_stage4_unit2_relu1 stage4_unit2_conv1 0=512 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=1048576 8=2
BatchNorm        stage4_unit2_bn2 1 1 stage4_unit2_conv1 stage4_unit2_bn2 0=512
Scale            stage4_unit2_bn2_scale 1 1 stage4_unit2_bn2 stage4_unit2_bn2_stage4_unit2_bn2_scale 0=512 1=1
ReLU             stage4_unit2_relu2 1 1 stage4_unit2_bn2_stage4_unit2_bn2_scale stage4_unit2_bn2_stage4_unit2_relu2
Convolution      stage4_unit2_conv2 1 1 stage4_unit2_bn2_stage4_unit2_relu2 stage4_unit2_conv2 0=512 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=2359296 8=2
BatchNorm        stage4_unit2_bn3 1 1 stage4_unit2_conv2 stage4_unit2_bn3 0=512
Scale            stage4_unit2_bn3_scale 1 1 stage4_unit2_bn3 stage4_unit2_bn3_stage4_unit2_bn3_scale 0=512 1=1
ReLU             stage4_unit2_relu3 1 1 stage4_unit2_bn3_stage4_unit2_bn3_scale stage4_unit2_bn3_stage4_unit2_relu3
Convolution      stage4_unit2_conv3 1 1 stage4_unit2_bn3_stage4_unit2_relu3 stage4_unit2_conv3 0=2048 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=1048576 8=2
Eltwise          plus14           2 1 stage4_unit2_conv3 plus13_splitncnn_0 plus14 0=1 -23301=0
Split            splitncnn_19     1 2 plus14 plus14_splitncnn_0 plus14_splitncnn_1
BatchNorm        stage4_unit3_bn1 1 1 plus14_splitncnn_1 stage4_unit3_bn1 0=2048
Scale            stage4_unit3_bn1_scale 1 1 stage4_unit3_bn1 stage4_unit3_bn1_stage4_unit3_bn1_scale 0=2048 1=1
ReLU             stage4_unit3_relu1 1 1 stage4_unit3_bn1_stage4_unit3_bn1_scale stage4_unit3_bn1_stage4_unit3_relu1
Convolution      stage4_unit3_conv1 1 1 stage4_unit3_bn1_stage4_unit3_relu1 stage4_unit3_conv1 0=512 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=1048576 8=2
BatchNorm        stage4_unit3_bn2 1 1 stage4_unit3_conv1 stage4_unit3_bn2 0=512
Scale            stage4_unit3_bn2_scale 1 1 stage4_unit3_bn2 stage4_unit3_bn2_stage4_unit3_bn2_scale 0=512 1=1
ReLU             stage4_unit3_relu2 1 1 stage4_unit3_bn2_stage4_unit3_bn2_scale stage4_unit3_bn2_stage4_unit3_relu2
Convolution      stage4_unit3_conv2 1 1 stage4_unit3_bn2_stage4_unit3_relu2 stage4_unit3_conv2 0=512 1=3 11=3 2=1 3=1 4=1 14=1 5=0 6=2359296 8=2
BatchNorm        stage4_unit3_bn3 1 1 stage4_unit3_conv2 stage4_unit3_bn3 0=512
Scale            stage4_unit3_bn3_scale 1 1 stage4_unit3_bn3 stage4_unit3_bn3_stage4_unit3_bn3_scale 0=512 1=1
ReLU             stage4_unit3_relu3 1 1 stage4_unit3_bn3_stage4_unit3_bn3_scale stage4_unit3_bn3_stage4_unit3_relu3
Convolution      stage4_unit3_conv3 1 1 stage4_unit3_bn3_stage4_unit3_relu3 stage4_unit3_conv3 0=2048 1=1 11=1 2=1 3=1 4=0 14=0 5=0 6=1048576 8=2
Eltwise          plus15           2 1 stage4_unit3_conv3 plus14_splitncnn_0 plus15 0=1 -23301=0
BatchNorm        bn1              1 1 plus15 bn1 0=2048
Scale            bn1_scale        1 1 bn1 bn1_bn1_scale 0=2048 1=1
ReLU             relu1            1 1 bn1_bn1_scale bn1_relu1
Convolution      ssh_c3_lateral   1 1 bn1_relu1 ssh_c3_lateral 0=256 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=524288 8=2
BatchNorm        ssh_c3_lateral_bn 1 1 ssh_c3_lateral ssh_c3_lateral_bn 0=256
Scale            ssh_c3_lateral_bn_scale 1 1 ssh_c3_lateral_bn ssh_c3_lateral_bn_ssh_c3_lateral_bn_scale 0=256 1=1
ReLU             ssh_c3_lateral_relu 1 1 ssh_c3_lateral_bn_ssh_c3_lateral_bn_scale ssh_c3_lateral_bn_ssh_c3_lateral_relu
Split            splitncnn_20     1 3 ssh_c3_lateral_bn_ssh_c3_lateral_relu ssh_c3_lateral_bn_ssh_c3_lateral_relu_splitncnn_0 ssh_c3_lateral_bn_ssh_c3_lateral_relu_splitncnn_1 ssh_c3_lateral_bn_ssh_c3_lateral_relu_splitncnn_2
Convolution      ssh_m3_det_conv1 1 1 ssh_c3_lateral_bn_ssh_c3_lateral_relu_splitncnn_2 ssh_m3_det_conv1 0=256 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=589824 8=2
Convolution      ssh_m3_det_context_conv1 1 1 ssh_c3_lateral_bn_ssh_c3_lateral_relu_splitncnn_1 ssh_m3_det_context_conv1 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=294912 8=2
DeconvolutionDepthWise ssh_c3_up_       1 1 ssh_c3_lateral_bn_ssh_c3_lateral_relu_splitncnn_0 ssh_c3_up 0=256 1=2 2=1 3=2 4=0 5=0 6=1024 7=256
BatchNorm        ssh_m3_det_conv1_bn 1 1 ssh_m3_det_conv1 ssh_m3_det_conv1_bn 0=256
Scale            ssh_m3_det_conv1_bn_scale 1 1 ssh_m3_det_conv1_bn ssh_m3_det_conv1_bn_ssh_m3_det_conv1_bn_scale 0=256 1=1
BatchNorm        ssh_m3_det_context_conv1_bn 1 1 ssh_m3_det_context_conv1 ssh_m3_det_context_conv1_bn 0=128
Scale            ssh_m3_det_context_conv1_bn_scale 1 1 ssh_m3_det_context_conv1_bn ssh_m3_det_context_conv1_bn_ssh_m3_det_context_conv1_bn_scale 0=128 1=1
Crop             crop0            2 1 ssh_c3_up ssh_c2_lateral_bn_ssh_c2_lateral_relu_splitncnn_1 crop0
ReLU             ssh_m3_det_context_conv1_relu 1 1 ssh_m3_det_context_conv1_bn_ssh_m3_det_context_conv1_bn_scale ssh_m3_det_context_conv1_bn_ssh_m3_det_context_conv1_relu
Split            splitncnn_21     1 2 ssh_m3_det_context_conv1_bn_ssh_m3_det_context_conv1_relu ssh_m3_det_context_conv1_bn_ssh_m3_det_context_conv1_relu_splitncnn_0 ssh_m3_det_context_conv1_bn_ssh_m3_det_context_conv1_relu_splitncnn_1
Eltwise          ssh_plus0        2 1 ssh_c2_lateral_bn_ssh_c2_lateral_relu_splitncnn_0 crop0 ssh_plus0 0=1 -23301=0
Convolution      ssh_m3_det_context_conv2 1 1 ssh_m3_det_context_conv1_bn_ssh_m3_det_context_conv1_relu_splitncnn_1 ssh_m3_det_context_conv2 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=147456 8=2
Convolution      ssh_m3_det_context_conv3_1 1 1 ssh_m3_det_context_conv1_bn_ssh_m3_det_context_conv1_relu_splitncnn_0 ssh_m3_det_context_conv3_1 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=147456 8=2
Convolution      ssh_c2_aggr      1 1 ssh_plus0 ssh_c2_aggr 0=256 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=589824 8=2
BatchNorm        ssh_m3_det_context_conv2_bn 1 1 ssh_m3_det_context_conv2 ssh_m3_det_context_conv2_bn 0=128
Scale            ssh_m3_det_context_conv2_bn_scale 1 1 ssh_m3_det_context_conv2_bn ssh_m3_det_context_conv2_bn_ssh_m3_det_context_conv2_bn_scale 0=128 1=1
BatchNorm        ssh_m3_det_context_conv3_1_bn 1 1 ssh_m3_det_context_conv3_1 ssh_m3_det_context_conv3_1_bn 0=128
Scale            ssh_m3_det_context_conv3_1_bn_scale 1 1 ssh_m3_det_context_conv3_1_bn ssh_m3_det_context_conv3_1_bn_ssh_m3_det_context_conv3_1_bn_scale 0=128 1=1
BatchNorm        ssh_c2_aggr_bn   1 1 ssh_c2_aggr ssh_c2_aggr_bn 0=256
Scale            ssh_c2_aggr_bn_scale 1 1 ssh_c2_aggr_bn ssh_c2_aggr_bn_ssh_c2_aggr_bn_scale 0=256 1=1
ReLU             ssh_m3_det_context_conv3_1_relu 1 1 ssh_m3_det_context_conv3_1_bn_ssh_m3_det_context_conv3_1_bn_scale ssh_m3_det_context_conv3_1_bn_ssh_m3_det_context_conv3_1_relu
ReLU             ssh_c2_aggr_relu 1 1 ssh_c2_aggr_bn_ssh_c2_aggr_bn_scale ssh_c2_aggr_bn_ssh_c2_aggr_relu
Split            splitncnn_22     1 3 ssh_c2_aggr_bn_ssh_c2_aggr_relu ssh_c2_aggr_bn_ssh_c2_aggr_relu_splitncnn_0 ssh_c2_aggr_bn_ssh_c2_aggr_relu_splitncnn_1 ssh_c2_aggr_bn_ssh_c2_aggr_relu_splitncnn_2
Convolution      ssh_m3_det_context_conv3_2 1 1 ssh_m3_det_context_conv3_1_bn_ssh_m3_det_context_conv3_1_relu ssh_m3_det_context_conv3_2 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=147456 8=2
Convolution      ssh_m2_det_conv1 1 1 ssh_c2_aggr_bn_ssh_c2_aggr_relu_splitncnn_2 ssh_m2_det_conv1 0=256 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=589824 8=2
Convolution      ssh_m2_det_context_conv1 1 1 ssh_c2_aggr_bn_ssh_c2_aggr_relu_splitncnn_1 ssh_m2_det_context_conv1 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=294912 8=2
DeconvolutionDepthWise ssh_m2_red_up    1 1 ssh_c2_aggr_bn_ssh_c2_aggr_relu_splitncnn_0 ssh_m2_red_up 0=256 1=2 2=1 3=2 4=0 5=0 6=1024 7=256
BatchNorm        ssh_m3_det_context_conv3_2_bn 1 1 ssh_m3_det_context_conv3_2 ssh_m3_det_context_conv3_2_bn 0=128
Scale            ssh_m3_det_context_conv3_2_bn_scale 1 1 ssh_m3_det_context_conv3_2_bn ssh_m3_det_context_conv3_2_bn_ssh_m3_det_context_conv3_2_bn_scale 0=128 1=1
BatchNorm        ssh_m2_det_conv1_bn 1 1 ssh_m2_det_conv1 ssh_m2_det_conv1_bn 0=256
Scale            ssh_m2_det_conv1_bn_scale 1 1 ssh_m2_det_conv1_bn ssh_m2_det_conv1_bn_ssh_m2_det_conv1_bn_scale 0=256 1=1
BatchNorm        ssh_m2_det_context_conv1_bn 1 1 ssh_m2_det_context_conv1 ssh_m2_det_context_conv1_bn 0=128
Scale            ssh_m2_det_context_conv1_bn_scale 1 1 ssh_m2_det_context_conv1_bn ssh_m2_det_context_conv1_bn_ssh_m2_det_context_conv1_bn_scale 0=128 1=1
Crop             crop1            2 1 ssh_m2_red_up ssh_m1_red_conv_bn_ssh_m1_red_conv_relu_splitncnn_1 crop1
Concat           ssh_m3_det_concat 3 1 ssh_m3_det_conv1_bn_ssh_m3_det_conv1_bn_scale ssh_m3_det_context_conv2_bn_ssh_m3_det_context_conv2_bn_scale ssh_m3_det_context_conv3_2_bn_ssh_m3_det_context_conv3_2_bn_scale ssh_m3_det_concat 0=0
ReLU             ssh_m2_det_context_conv1_relu 1 1 ssh_m2_det_context_conv1_bn_ssh_m2_det_context_conv1_bn_scale ssh_m2_det_context_conv1_bn_ssh_m2_det_context_conv1_relu
Split            splitncnn_23     1 2 ssh_m2_det_context_conv1_bn_ssh_m2_det_context_conv1_relu ssh_m2_det_context_conv1_bn_ssh_m2_det_context_conv1_relu_splitncnn_0 ssh_m2_det_context_conv1_bn_ssh_m2_det_context_conv1_relu_splitncnn_1
Eltwise          ssh_plus1        2 1 ssh_m1_red_conv_bn_ssh_m1_red_conv_relu_splitncnn_0 crop1 ssh_plus1 0=1 -23301=0
ReLU             ssh_m3_det_concat_relu 1 1 ssh_m3_det_concat ssh_m3_det_concat_ssh_m3_det_concat_relu
Split            splitncnn_24     1 3 ssh_m3_det_concat_ssh_m3_det_concat_relu ssh_m3_det_concat_ssh_m3_det_concat_relu_splitncnn_0 ssh_m3_det_concat_ssh_m3_det_concat_relu_splitncnn_1 ssh_m3_det_concat_ssh_m3_det_concat_relu_splitncnn_2
Convolution      ssh_m2_det_context_conv2 1 1 ssh_m2_det_context_conv1_bn_ssh_m2_det_context_conv1_relu_splitncnn_1 ssh_m2_det_context_conv2 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=147456 8=2
Convolution      ssh_m2_det_context_conv3_1 1 1 ssh_m2_det_context_conv1_bn_ssh_m2_det_context_conv1_relu_splitncnn_0 ssh_m2_det_context_conv3_1 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=147456 8=2
Convolution      ssh_c1_aggr      1 1 ssh_plus1 ssh_c1_aggr 0=256 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=589824 8=2
Convolution      face_rpn_cls_score_stride32 1 1 ssh_m3_det_concat_ssh_m3_det_concat_relu_splitncnn_2 face_rpn_cls_score_stride32 0=4 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=2048 8=2
Convolution      face_rpn_bbox_pred_stride32 1 1 ssh_m3_det_concat_ssh_m3_det_concat_relu_splitncnn_1 face_rpn_bbox_pred_stride32 0=8 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=4096 8=2
Convolution      face_rpn_landmark_pred_stride32 1 1 ssh_m3_det_concat_ssh_m3_det_concat_relu_splitncnn_0 face_rpn_landmark_pred_stride32 0=20 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=10240 8=2
BatchNorm        ssh_m2_det_context_conv2_bn 1 1 ssh_m2_det_context_conv2 ssh_m2_det_context_conv2_bn 0=128
Scale            ssh_m2_det_context_conv2_bn_scale 1 1 ssh_m2_det_context_conv2_bn ssh_m2_det_context_conv2_bn_ssh_m2_det_context_conv2_bn_scale 0=128 1=1
BatchNorm        ssh_m2_det_context_conv3_1_bn 1 1 ssh_m2_det_context_conv3_1 ssh_m2_det_context_conv3_1_bn 0=128
Scale            ssh_m2_det_context_conv3_1_bn_scale 1 1 ssh_m2_det_context_conv3_1_bn ssh_m2_det_context_conv3_1_bn_ssh_m2_det_context_conv3_1_bn_scale 0=128 1=1
BatchNorm        ssh_c1_aggr_bn   1 1 ssh_c1_aggr ssh_c1_aggr_bn 0=256
Scale            ssh_c1_aggr_bn_scale 1 1 ssh_c1_aggr_bn ssh_c1_aggr_bn_ssh_c1_aggr_bn_scale 0=256 1=1
Reshape          face_rpn_cls_score_reshape_stride32 1 1 face_rpn_cls_score_stride32 face_rpn_cls_score_reshape_stride32 0=0 1=-1 2=2 3=0
ReLU             ssh_m2_det_context_conv3_1_relu 1 1 ssh_m2_det_context_conv3_1_bn_ssh_m2_det_context_conv3_1_bn_scale ssh_m2_det_context_conv3_1_bn_ssh_m2_det_context_conv3_1_relu
ReLU             ssh_c1_aggr_relu 1 1 ssh_c1_aggr_bn_ssh_c1_aggr_bn_scale ssh_c1_aggr_bn_ssh_c1_aggr_relu
Split            splitncnn_25     1 2 ssh_c1_aggr_bn_ssh_c1_aggr_relu ssh_c1_aggr_bn_ssh_c1_aggr_relu_splitncnn_0 ssh_c1_aggr_bn_ssh_c1_aggr_relu_splitncnn_1
Softmax          face_rpn_cls_prob_stride32 1 1 face_rpn_cls_score_reshape_stride32 face_rpn_cls_prob_stride32 0=0 1=1
Convolution      ssh_m2_det_context_conv3_2 1 1 ssh_m2_det_context_conv3_1_bn_ssh_m2_det_context_conv3_1_relu ssh_m2_det_context_conv3_2 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=147456 8=2
Convolution      ssh_m1_det_conv1 1 1 ssh_c1_aggr_bn_ssh_c1_aggr_relu_splitncnn_1 ssh_m1_det_conv1 0=256 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=589824 8=2
Convolution      ssh_m1_det_context_conv1 1 1 ssh_c1_aggr_bn_ssh_c1_aggr_relu_splitncnn_0 ssh_m1_det_context_conv1 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=294912 8=2
Reshape          face_rpn_cls_prob_reshape_stride32 1 1 face_rpn_cls_prob_stride32 face_rpn_cls_prob_reshape_stride32 0=0 1=-1 2=4 3=0
BatchNorm        ssh_m2_det_context_conv3_2_bn 1 1 ssh_m2_det_context_conv3_2 ssh_m2_det_context_conv3_2_bn 0=128
Scale            ssh_m2_det_context_conv3_2_bn_scale 1 1 ssh_m2_det_context_conv3_2_bn ssh_m2_det_context_conv3_2_bn_ssh_m2_det_context_conv3_2_bn_scale 0=128 1=1
BatchNorm        ssh_m1_det_conv1_bn 1 1 ssh_m1_det_conv1 ssh_m1_det_conv1_bn 0=256
Scale            ssh_m1_det_conv1_bn_scale 1 1 ssh_m1_det_conv1_bn ssh_m1_det_conv1_bn_ssh_m1_det_conv1_bn_scale 0=256 1=1
BatchNorm        ssh_m1_det_context_conv1_bn 1 1 ssh_m1_det_context_conv1 ssh_m1_det_context_conv1_bn 0=128
Scale            ssh_m1_det_context_conv1_bn_scale 1 1 ssh_m1_det_context_conv1_bn ssh_m1_det_context_conv1_bn_ssh_m1_det_context_conv1_bn_scale 0=128 1=1
Concat           ssh_m2_det_concat 3 1 ssh_m2_det_conv1_bn_ssh_m2_det_conv1_bn_scale ssh_m2_det_context_conv2_bn_ssh_m2_det_context_conv2_bn_scale ssh_m2_det_context_conv3_2_bn_ssh_m2_det_context_conv3_2_bn_scale ssh_m2_det_concat 0=0
ReLU             ssh_m1_det_context_conv1_relu 1 1 ssh_m1_det_context_conv1_bn_ssh_m1_det_context_conv1_bn_scale ssh_m1_det_context_conv1_bn_ssh_m1_det_context_conv1_relu
Split            splitncnn_26     1 2 ssh_m1_det_context_conv1_bn_ssh_m1_det_context_conv1_relu ssh_m1_det_context_conv1_bn_ssh_m1_det_context_conv1_relu_splitncnn_0 ssh_m1_det_context_conv1_bn_ssh_m1_det_context_conv1_relu_splitncnn_1
ReLU             ssh_m2_det_concat_relu 1 1 ssh_m2_det_concat ssh_m2_det_concat_ssh_m2_det_concat_relu
Split            splitncnn_27     1 3 ssh_m2_det_concat_ssh_m2_det_concat_relu ssh_m2_det_concat_ssh_m2_det_concat_relu_splitncnn_0 ssh_m2_det_concat_ssh_m2_det_concat_relu_splitncnn_1 ssh_m2_det_concat_ssh_m2_det_concat_relu_splitncnn_2
Convolution      ssh_m1_det_context_conv2 1 1 ssh_m1_det_context_conv1_bn_ssh_m1_det_context_conv1_relu_splitncnn_1 ssh_m1_det_context_conv2 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=147456 8=2
Convolution      ssh_m1_det_context_conv3_1 1 1 ssh_m1_det_context_conv1_bn_ssh_m1_det_context_conv1_relu_splitncnn_0 ssh_m1_det_context_conv3_1 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=147456 8=2
Convolution      face_rpn_cls_score_stride16 1 1 ssh_m2_det_concat_ssh_m2_det_concat_relu_splitncnn_2 face_rpn_cls_score_stride16 0=4 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=2048 8=2
Convolution      face_rpn_bbox_pred_stride16 1 1 ssh_m2_det_concat_ssh_m2_det_concat_relu_splitncnn_1 face_rpn_bbox_pred_stride16 0=8 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=4096 8=2
Convolution      face_rpn_landmark_pred_stride16 1 1 ssh_m2_det_concat_ssh_m2_det_concat_relu_splitncnn_0 face_rpn_landmark_pred_stride16 0=20 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=10240 8=2
BatchNorm        ssh_m1_det_context_conv2_bn 1 1 ssh_m1_det_context_conv2 ssh_m1_det_context_conv2_bn 0=128
Scale            ssh_m1_det_context_conv2_bn_scale 1 1 ssh_m1_det_context_conv2_bn ssh_m1_det_context_conv2_bn_ssh_m1_det_context_conv2_bn_scale 0=128 1=1
BatchNorm        ssh_m1_det_context_conv3_1_bn 1 1 ssh_m1_det_context_conv3_1 ssh_m1_det_context_conv3_1_bn 0=128
Scale            ssh_m1_det_context_conv3_1_bn_scale 1 1 ssh_m1_det_context_conv3_1_bn ssh_m1_det_context_conv3_1_bn_ssh_m1_det_context_conv3_1_bn_scale 0=128 1=1
Reshape          face_rpn_cls_score_reshape_stride16 1 1 face_rpn_cls_score_stride16 face_rpn_cls_score_reshape_stride16 0=0 1=-1 2=2 3=0
ReLU             ssh_m1_det_context_conv3_1_relu 1 1 ssh_m1_det_context_conv3_1_bn_ssh_m1_det_context_conv3_1_bn_scale ssh_m1_det_context_conv3_1_bn_ssh_m1_det_context_conv3_1_relu
Softmax          face_rpn_cls_prob_stride16 1 1 face_rpn_cls_score_reshape_stride16 face_rpn_cls_prob_stride16 0=0 1=1
Convolution      ssh_m1_det_context_conv3_2 1 1 ssh_m1_det_context_conv3_1_bn_ssh_m1_det_context_conv3_1_relu ssh_m1_det_context_conv3_2 0=128 1=3 11=3 2=1 3=1 4=1 14=1 5=1 6=147456 8=2
Reshape          face_rpn_cls_prob_reshape_stride16 1 1 face_rpn_cls_prob_stride16 face_rpn_cls_prob_reshape_stride16 0=0 1=-1 2=4 3=0
BatchNorm        ssh_m1_det_context_conv3_2_bn 1 1 ssh_m1_det_context_conv3_2 ssh_m1_det_context_conv3_2_bn 0=128
Scale            ssh_m1_det_context_conv3_2_bn_scale 1 1 ssh_m1_det_context_conv3_2_bn ssh_m1_det_context_conv3_2_bn_ssh_m1_det_context_conv3_2_bn_scale 0=128 1=1
Concat           ssh_m1_det_concat 3 1 ssh_m1_det_conv1_bn_ssh_m1_det_conv1_bn_scale ssh_m1_det_context_conv2_bn_ssh_m1_det_context_conv2_bn_scale ssh_m1_det_context_conv3_2_bn_ssh_m1_det_context_conv3_2_bn_scale ssh_m1_det_concat 0=0
ReLU             ssh_m1_det_concat_relu 1 1 ssh_m1_det_concat ssh_m1_det_concat_ssh_m1_det_concat_relu
Split            splitncnn_28     1 3 ssh_m1_det_concat_ssh_m1_det_concat_relu ssh_m1_det_concat_ssh_m1_det_concat_relu_splitncnn_0 ssh_m1_det_concat_ssh_m1_det_concat_relu_splitncnn_1 ssh_m1_det_concat_ssh_m1_det_concat_relu_splitncnn_2
Convolution      face_rpn_cls_score_stride8 1 1 ssh_m1_det_concat_ssh_m1_det_concat_relu_splitncnn_2 face_rpn_cls_score_stride8 0=4 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=2048 8=2
Convolution      face_rpn_bbox_pred_stride8 1 1 ssh_m1_det_concat_ssh_m1_det_concat_relu_splitncnn_1 face_rpn_bbox_pred_stride8 0=8 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=4096 8=2
Convolution      face_rpn_landmark_pred_stride8 1 1 ssh_m1_det_concat_ssh_m1_det_concat_relu_splitncnn_0 face_rpn_landmark_pred_stride8 0=20 1=1 11=1 2=1 3=1 4=0 14=0 5=1 6=10240 8=2
Reshape          face_rpn_cls_score_reshape_stride8 1 1 face_rpn_cls_score_stride8 face_rpn_cls_score_reshape_stride8 0=0 1=-1 2=2 3=0
Softmax          face_rpn_cls_prob_stride8 1 1 face_rpn_cls_score_reshape_stride8 face_rpn_cls_prob_stride8 0=0 1=1
Reshape          face_rpn_cls_prob_reshape_stride8 1 1 face_rpn_cls_prob_stride8 face_rpn_cls_prob_reshape_stride8 0=0 1=-1 2=4 3=0
